app/controllers/states_controller.rb

SELECT * FROM "states"
---
  def index
    @states = State.all

SELECT * FROM "states" WHERE ("states"."id" = 1)
---
  def show
    @state = State.find(params[:id])

INSERT INTO "states" ("created_at", "title", "updated_at", "date", "content", "status") VALUES('2010-09-02 11:39:11', 'Maintenance Downtime Zone A', '2010-09-02 11:39:11', '2010-09-02 11:38:00', 'Zone A is currently unavailable due to planned maintenance. The maintenance is expected to take no longer than 60 minutes.', 'ONGOING')
---
  def create
    @state = State.new(params[:state])
    if @state.save

SELECT * FROM "states" WHERE ("states"."id" = 5)
---
  def edit
    @state = State.find(params[:id])

SELECT * FROM "states" WHERE ("states"."id" = 5)
UPDATE "states" SET "updated_at" = '2010-09-03 09:49:42', "status" = 'RESOLVED' WHERE "id" = 5
---
  def update
    @state = State.find(params[:id])
    if @state.update_attributes(params[:state])

SELECT * FROM "states" WHERE ("states"."id" = 5)
DELETE FROM "states" WHERE "id" = 5
---
  def destroy
    @state = State.find(params[:id])
    @state.destroy